In [1]:
import pandas as pd
import numpy as np

In [4]:
data = pd.read_csv(r"C:\Users\MF\Downloads\kiwilytics_orders.csv")

In [5]:
df = pd.DataFrame(data)

In [6]:
df.shape

(100, 6)

In [8]:
df.head()

   order_id customer_name     product  quantity  unit_price  order_date
0         1         Maria  Kiwi Chips         2         3.0  2024-01-29
1         2       Richard  Kiwi Chips         1         3.0  2024-01-08
2         3      Nicholas  Kiwi Candy         1         2.5  2024-01-25
3         4       Raymond  Kiwi Candy         4         NaN  2024-01-04
4         5         David  Kiwi Juice         1         4.5  2024-02-25

In [10]:
type('order_date')

str

In [11]:
print(df.isna().sum())

order_id         0
customer_name    0
product          0
quantity         0
unit_price       8
order_date       0
dtype: int64

In [13]:
mean_unit_price = df['unit_price'].mean()
mean_unit_price

np.float64(3.9619565217391304)

In [16]:
df['unit_price'] = df['unit_price'].fillna(mean_unit_price)

In [17]:
print(df.isna().sum())

order_id         0
customer_name    0
product          0
quantity         0
unit_price       0
order_date       0
dtype: int64

In [18]:
df.head()

   order_id customer_name     product  quantity  unit_price  order_date
0         1         Maria  Kiwi Chips         2    3.000000  2024-01-29
1         2       Richard  Kiwi Chips         1    3.000000  2024-01-08
2         3      Nicholas  Kiwi Candy         1    2.500000  2024-01-25
3         4       Raymond  Kiwi Candy         4    3.961957  2024-01-04
4         5         David  Kiwi Juice         1    4.500000  2024-02-25

In [22]:
df['total_price'] = df['quantity']*df['unit_price']

In [23]:
df.head()

,order_id,customer_name,product,quantity,unit_price,order_date,total_price
0,1,Maria,Kiwi Chips,2,3.000000,2024-01-29,6.000000
1,2,Richard,Kiwi Chips,1,3.000000,2024-01-08,3.000000
2,3,Nicholas,Kiwi Candy,1,2.500000,2024-01-25,2.500000
3,4,Raymond,Kiwi Candy,4,3.961957,2024-01-04,15.847826
4,5,David,Kiwi Juice,1,4.500000,2024-02-25,4.500000

In [24]:
total_revenu = df['total_price'].sum()
total_revenu

np.float64(1161.2391304347827)

In [31]:
print(df.groupby('product')['quantity'].sum())

product
Kiwi Candy       70
Kiwi Chips       73
Kiwi Jam         41
Kiwi Juice       61
Kiwi Smoothie    46
Name: quantity, dtype: int64

In [33]:
customer=df.groupby('customer_name')['total_price'].sum()

In [44]:
df.head()

,order_id,customer_name,product,quantity,unit_price,order_date,total_price
0,1,Maria,Kiwi Chips,2,3.000000,2024-01-29,6.000000
1,2,Richard,Kiwi Chips,1,3.000000,2024-01-08,3.000000
2,3,Nicholas,Kiwi Candy,1,2.500000,2024-01-25,2.500000
3,4,Raymond,Kiwi Candy,4,3.961957,2024-01-04,15.847826
4,5,David,Kiwi Juice,1,4.500000,2024-02-25,4.500000

In [52]:
customer_spending = df.groupby("customer_name")["total_price"].sum().sort_values(ascending=False)

#top_customer_name = customer_spending.index[0]
#top_customer_spending = customer_spending.iloc[0]
#print("\nTop customer =", top_customer_name)
#print("Top customer spending =", top_customer_spending)

print(customer_spending.head(1))

customer_name
Eric    100.5
Name: total_price, dtype: float64